/*
 * JLNU_Servo.c
 *
 *  Created on: 2025年9月12日
 *      Author: 20461
 */
#include "zf_common_headfile.h"  // 包含必要的头文件

int16 pwm_r = 200;
int16 pwm_l = 200;
int16 High_Left_Point = 200;
int16 High_Right_Point = 200;
//-------------------------------------------------------------------------------------------------------------------
// 函数简介     四路舵机初始化函数
// 参数说明     void
// 返回参数     void
// 使用示例     Servo_Four_Init();
// 备注信息     初始化四个舵机PWM通道，设置频率为50Hz，周期为5000（对应20ms周期）
//-------------------------------------------------------------------------------------------------------------------
void Servo_Four_Init()
{
    pwm_init(TCPWM_CH25_P09_1, 50, 5000);  // 初始化原子0通道4，引脚P02_4，频率50Hz，周期5000
    pwm_init(TCPWM_CH24_P09_0, 50, 5000);  // 初始化原子0通道5，引脚P02_5，频率50Hz，周期5000
    pwm_init(TCPWM_CH31_P10_3, 50, 5000);  // 初始化原子0通道6，引脚P02_6，频率50Hz，周期5000
    pwm_init(TCPWM_CH30_P10_2, 50, 5000);  // 初始化原子0通道7，引脚P02_7，频率50Hz，周期5000
    
    
   
    //同时设定初始角度值
    Servo_Left_On(pwm_l);
    Servo_Right_On(pwm_r);
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     左侧舵机控制函数
// 参数说明     Height      舵机高度值，范围-300到700
// 返回参数     void
// 使用示例     Servo_Left_On(300); // 设置左侧舵机高度为300
// 备注信息     控制左侧两个舵机，一个正向运动，一个反向运动，实现对称控制
//-------------------------------------------------------------------------------------------------------------------
void Servo_Left_On(int16 Height) // -300到700
{
    // 设置左侧第一个舵机占空比：基础值550加上高度值（正向运动）
    pwm_set_duty(TCPWM_CH25_P09_1, 550 + Height+60);

    // 设置左侧第二个舵机占空比：基础值950减去高度值（反向运动）
    pwm_set_duty(TCPWM_CH24_P09_0, 950 - Height);
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     右侧舵机控制函数
// 参数说明     Height      舵机高度值，范围-300到700
// 返回参数     void
// 使用示例     Servo_Right_On(300); // 设置右侧舵机高度为300
// 备注信息     控制右侧两个舵机，一个正向运动，一个反向运动，实现对称控制
//-------------------------------------------------------------------------------------------------------------------
void Servo_Right_On(int16 Height)
{
    // 设置右侧第一个舵机占空比：基础值950减去高度值（反向运动）
    pwm_set_duty(TCPWM_CH31_P10_3, 950 - Height);

    // 设置右侧第二个舵机占空比：基础值550加上高度值（正向运动）
    pwm_set_duty(TCPWM_CH30_P10_2, 550 + Height);
}

